
print("Добро пожаловать на Остров Сокровищ!")
print("Твоя миссия - найти спрятанные сокровища пиратов.")
crossing = input("Ты стоишь на перекрестке дорог. Пойдем направо или налево? 'направо' или 'налево': \n")
if crossing.lower() == "направо":
    print("Тебя поймали гоблины... Игра окончена :-(")
else:
    print("Ты на берегу огромного зловещего озера.")
    lake = input("Будешь ждать паром для переправы или поплывёшь? 'ждать' или 'плыть': \n")
    if lake.lower() == "плыть":
        print("Озеро кишит аллигаторами. У тебя не было шансов... Игра окончена :-(")
    else:
        print("Паромщик переправил тебя за несколько мелких монет. Теперь ты перед старинным замком.")
        castle = input("Перед тобой три двери. Какую ты откроешь? 'красную', 'желтую' или 'синюю'? \n")
        if castle.lower() == "красную" or castle.lower() == "синюю":
            print("Это ловушка!!! Всё пропало! Игра окончена.")
        else:
            print('''
*******************************************************************************
          |                   |                  |                     |
 _________|________________.=""_;=.______________|_____________________|_______
|                   |  ,-"_,=""     `"=.|                  |
|___________________|__"=._o`"-._        `"=.______________|___________________
          |                `"=._o`"=._      _`"=._                     |
 _________|_____________________:=._o "=._."_.-="'"=.__________________|_______
|                   |    __.--" , ; `"=._o." ,-"""-._ ".   |
|___________________|_._"  ,. .` ` `` ,  `"-._"-._   ". '__|___________________
          |           |o`"=._` , "` `; .". ,  "-._"-._; ;              |
 _________|___________| ;`-.o`"=._; ." ` '`."\` . "-._ /_______________|_______
|                   | |o;    `"-.o`"=._``  '` " ,__.--o;   |
|___________________|_| ;     (#) `-.o `"=.`_.--"_o.-; ;___|___________________
____/______/______/___|o;._    "      `".o|o_.--"    ;o;____/______/______/____
/______/______/______/_"=._o--._        ; | ;        ; ;/______/______/______/_
____/______/______/______/__"=._o--._   ;o|o;     _._;o;____/______/______/____
/______/______/______/______/____"=._o._; | ;_.--"o.--"_/______/______/______/_
____/______/______/______/______/_____"=.o|o_.--""___/______/______/______/____
/______/______/______/______/______/______/______/______/______/______/_____ /
*******************************************************************************
''')